<% graph.operations.each do |operation|
   op_def = Tensorflow.op_def(operation.op_type) %>
node {
  name: "<%= operation.name %>"
  op: "<%= operation.op_type %>"
  <% operation.inputs.each do |input| %>
  input: "<%= input.name %>"
  <% end %>
  <% op_def.attr.sort_by(&:name).each do |attr_def|
     attr = operation.attr(attr_def.name) %>
  attr {
    key: "<%= attr_def.name %>"
    value {
  <% case attr.metadata[:type]  %>
    <% when :tensor %>
      tensor {
        dtype: DT_<%= attr.tensor.dtype.upcase %>
        tensor_shape {
          <% unless attr.tensor.shape.empty? %>
          <%= attr.tensor.shape %>
          <% end %>
        }
        <%= attr.tensor.dtype %>_val: <%= attr.tensor.value %>
      }
    <% when :type %>
      type: DT_<%= attr.dtype.to_s.upcase %>
    <% end %>
    }
  }
  <% end %>
}
<% end %>